witalis3/UA3REO-DDC-Transceiver/STM32/Src/front_unit.c
	//NOTCH - default action
	if (CurrentVFO->ManualNotchFilter)
	{
		if (CurrentVFO->NotchFC > 50 && direction < 0)
			CurrentVFO->NotchFC -= 50;
		else if (CurrentVFO->NotchFC < CurrentVFO->LPF_RX_Filter_Width && direction > 0)
			CurrentVFO->NotchFC += 50;
		LCD_UpdateQuery.StatusInfoGUI = true;
		NeedReinitNotch = true;
	}
	else
	{
		if (!enc2_func_mode || CurrentVFO->Mode != TRX_MODE_CW)
		{
			uint32_t newfreq = 0;
			float64_t freq_round = 0;
			float64_t step = 0;
			if (TRX.ChannelMode && getBandFromFreq(CurrentVFO->Freq, false) != -1 && BANDS[getBandFromFreq(CurrentVFO->Freq, false)].channelsCount > 0)
			{
				int_fast8_t band = getBandFromFreq(CurrentVFO->Freq, false);
				int_fast8_t channel = getChannelbyFreq(CurrentVFO->Freq, false);
				int_fast8_t new_channel = channel + direction;
				if(new_channel < 0)
					new_channel = BANDS[band].channelsCount - 1;
				if(new_channel >= BANDS[band].channelsCount)
					new_channel = 0;
				
				newfreq = BANDS[band].channels[new_channel].rxFreq;
				TRX.CLAR = BANDS[band].channels_clar;
				if(BANDS[band].channels_clar)
					TRX_setFrequency(BANDS[band].channels[new_channel].txFreq, SecondaryVFO);
				LCD_UpdateQuery.FreqInfoRedraw = true;
				LCD_UpdateQuery.StatusInfoGUI = true;
				LCD_UpdateQuery.StatusInfoBarRedraw = true;
			}
			else if (TRX.Fast)
			{
				step = (float64_t)TRX.FRQ_ENC_FAST_STEP;
				if (CurrentVFO->Mode == TRX_MODE_WFM)
					step = step * 2.0;
				freq_round = roundf((float64_t)CurrentVFO->Freq / step) * step;
				newfreq = (uint32_t)((int32_t)freq_round + (int32_t)step * direction);
			}
			else
			{
				step = (float64_t)TRX.FRQ_ENC_STEP;
				if (CurrentVFO->Mode == TRX_MODE_WFM)
					step = step * 2.0;
				freq_round = roundf((float64_t)CurrentVFO->Freq / step) * step;
				newfreq = (uint32_t)((int32_t)freq_round + (int32_t)step * direction);
			}
			TRX_setFrequency(newfreq, CurrentVFO);
			LCD_UpdateQuery.FreqInfo = true;
		}
		else
		{
			//ENC2 Func mode (WPM)
			TRX.CW_KEYER_WPM += direction;
			if (TRX.CW_KEYER_WPM < 1)
				TRX.CW_KEYER_WPM = 1;
			if (TRX.CW_KEYER_WPM > 200)
				TRX.CW_KEYER_WPM = 200;
			char sbuff[32] = {0};
			sprintf(sbuff, "WPM: %u", TRX.CW_KEYER_WPM);
			LCD_showTooltip(sbuff);
		}
	}
}

void FRONTPANEL_check_ENC2SW(void)
{
// check touchpad events
#ifdef HAS_TOUCHPAD
	return;
#endif

	static uint32_t menu_enc2_click_starttime = 0;
	static bool ENC2SW_Last = true;
	static bool ENC2SW_clicked = false;
	static bool ENC2SW_hold_start = false;
	static bool ENC2SW_holded = false;
	ENC2SW_clicked = false;
	ENC2SW_holded = false;

	if (TRX.Locked)
		return;

	bool ENC2SW_AND_TOUCH_Now = HAL_GPIO_ReadPin(ENC2SW_AND_TOUCHPAD_GPIO_Port, ENC2SW_AND_TOUCHPAD_Pin);
	//check hold and click
	if (ENC2SW_Last != ENC2SW_AND_TOUCH_Now)
	{
		ENC2SW_Last = ENC2SW_AND_TOUCH_Now;
		if (!ENC2SW_AND_TOUCH_Now)
		{
			menu_enc2_click_starttime = HAL_GetTick();
			ENC2SW_hold_start = true;
		}
	}
	if (!ENC2SW_AND_TOUCH_Now && ENC2SW_hold_start)
	{
		if ((HAL_GetTick() - menu_enc2_click_starttime) > KEY_HOLD_TIME)
		{
			ENC2SW_holded = true;
			ENC2SW_hold_start = false;
		}
	}
	if (ENC2SW_AND_TOUCH_Now && ENC2SW_hold_start)
	{
		if ((HAL_GetTick() - menu_enc2_click_starttime) > 1)
		{
			ENC2SW_clicked = true;
			ENC2SW_hold_start = false;
		}
	}

	//ENC2 Button hold
	if (ENC2SW_holded)
	{
		FRONTPANEL_ENC2SW_hold_handler(0);
	}

	//ENC2 Button click
	if (ENC2SW_clicked)
	{
		menu_enc2_click_starttime = HAL_GetTick();
		FRONTPANEL_ENC2SW_click_handler(0);
	}
}

static void FRONTPANEL_ENC2SW_click_handler(uint32_t parameter)
{
	//ENC2 CLICK
	if (CurrentVFO->Mode == TRX_MODE_CW && !LCD_systemMenuOpened && !LCD_window.opened)
	{
		enc2_func_mode = !enc2_func_mode; //enc2 rotary mode

		if (!enc2_func_mode)
			LCD_showTooltip("FAST STEP");
		else
			LCD_showTooltip("SET WPM");
	}
	else
	{
		if (LCD_systemMenuOpened)
		{
			//navigate in menu
			SYSMENU_eventSecEncoderClickSystemMenu();
		}
	}
}

static void FRONTPANEL_ENC2SW_hold_handler(uint32_t parameter)
{
	FRONTPANEL_BUTTONHANDLER_MENU(0);
}

void FRONTPANEL_Init(void)
{
	uint16_t test_value = 0;
#ifdef HRDW_MCP3008_1
	test_value = FRONTPANEL_ReadMCP3008_Value(0, AD1_CS_GPIO_Port, AD1_CS_Pin);
	if (test_value == 65535)
	{
		FRONTPanel_MCP3008_1_Enabled = false;
		println("[ERR] Frontpanel MCP3008 - 1 not found, disabling... (FPGA SPI/I2S CLOCK ERROR?)");
		LCD_showError("MCP3008 - 1 init error (FPGA I2S CLK?)", true);
	}
#endif
#ifdef HRDW_MCP3008_2
	test_value = FRONTPANEL_ReadMCP3008_Value(0, AD2_CS_GPIO_Port, AD2_CS_Pin);
	if (test_value == 65535)
	{
		FRONTPanel_MCP3008_2_Enabled = false;
		println("[ERR] Frontpanel MCP3008 - 2 not found, disabling... (FPGA SPI/I2S CLOCK ERROR?)");
		LCD_showError("MCP3008 - 2 init error", true);
	}
#endif
#ifdef HRDW_MCP3008_3
	test_value = FRONTPANEL_ReadMCP3008_Value(0, AD3_CS_GPIO_Port, AD3_CS_Pin);
	if (test_value == 65535)
	{
		FRONTPanel_MCP3008_3_Enabled = false;
		println("[ERR] Frontpanel MCP3008 - 3 not found, disabling... (FPGA SPI/I2S CLOCK ERROR?)");
		LCD_showError("MCP3008 - 3 init error", true);
	}
#endif
	FRONTPANEL_Process();
}

void FRONTPANEL_Process(void)
{
	if (LCD_systemMenuOpened && !LCD_busy && FRONTPANEL_ProcessEncoder1 != 0)
	{
		SYSMENU_eventRotateSystemMenu(FRONTPANEL_ProcessEncoder1);
		FRONTPANEL_ProcessEncoder1 = 0;
	}

	if (FRONTPANEL_ProcessEncoder2 != 0)
	{
		FRONTPANEL_ENCODER2_Rotated(FRONTPANEL_ProcessEncoder2);
		FRONTPANEL_ProcessEncoder2 = 0;
	}

#ifndef HAS_TOUCHPAD
	FRONTPANEL_check_ENC2SW();
#endif

	if(SD_USBCardReader)
		return;
	if (SPI_process)
		return;
	SPI_process = true;
	
	static uint32_t fu_debug_lasttime = 0;
	uint16_t buttons_count = sizeof(PERIPH_FrontPanel_Buttons) / sizeof(PERIPH_FrontPanel_Button);
	uint16_t mcp3008_value = 0;

	//process buttons
	for (uint16_t b = 0; b < buttons_count; b++)
	{
//check disabled ports
#ifdef HRDW_MCP3008_1
		if (PERIPH_FrontPanel_Buttons[b].port == 1 && !FRONTPanel_MCP3008_1_Enabled)
			continue;
#endif
#ifdef HRDW_MCP3008_2
		if (PERIPH_FrontPanel_Buttons[b].port == 2 && !FRONTPanel_MCP3008_2_Enabled)
			continue;
#endif
#ifdef HRDW_MCP3008_3
		if (PERIPH_FrontPanel_Buttons[b].port == 3 && !FRONTPanel_MCP3008_3_Enabled)
			continue;
#endif

//get state from ADC MCP3008 (10bit - 1024values)
#ifdef HRDW_MCP3008_1
		if (PERIPH_FrontPanel_Buttons[b].port == 1)
			mcp3008_value = FRONTPANEL_ReadMCP3008_Value(PERIPH_FrontPanel_Buttons[b].channel, AD1_CS_GPIO_Port, AD1_CS_Pin);
		else
#endif
#ifdef HRDW_MCP3008_2
			if (PERIPH_FrontPanel_Buttons[b].port == 2)
			mcp3008_value = FRONTPANEL_ReadMCP3008_Value(PERIPH_FrontPanel_Buttons[b].channel, AD2_CS_GPIO_Port, AD2_CS_Pin);
		else
#endif
#ifdef HRDW_MCP3008_3
			if (PERIPH_FrontPanel_Buttons[b].port == 3)
			mcp3008_value = FRONTPANEL_ReadMCP3008_Value(PERIPH_FrontPanel_Buttons[b].channel, AD3_CS_GPIO_Port, AD3_CS_Pin);
		else
#endif
			continue;

		if (TRX.Debug_Type == TRX_DEBUG_BUTTONS)
		{
			static uint8_t fu_gebug_lastchannel = 255;
			if ((HAL_GetTick() - fu_debug_lasttime > 500 && fu_gebug_lastchannel != PERIPH_FrontPanel_Buttons[b].channel) || fu_debug_lasttime == 0)
			{
				println("F_UNIT: port ", PERIPH_FrontPanel_Buttons[b].port, " channel ", PERIPH_FrontPanel_Buttons[b].channel, " value ", mcp3008_value);
				fu_gebug_lastchannel = PERIPH_FrontPanel_Buttons[b].channel;
			}
		}

		// AF_GAIN
		if (PERIPH_FrontPanel_Buttons[b].type == FUNIT_CTRL_AF_GAIN)
		{
			TRX_Volume = (uint16_t)(1023.0f - mcp3008_value);
			if (TRX_Volume < 50)
				TRX_Volume = 0;
		}

		// SHIFT or IF Gain
		if (PERIPH_FrontPanel_Buttons[b].type == FUNIT_CTRL_SHIFT)
		{
			if (TRX.ShiftEnabled)
			{
				int_fast16_t TRX_SHIFT_old = TRX_SHIFT;
				TRX_SHIFT = (int_fast16_t)(((1023.0f - mcp3008_value) * TRX.SHIFT_INTERVAL * 2 / 1023.0f) - TRX.SHIFT_INTERVAL);
				if (TRX_SHIFT_old != TRX_SHIFT)
				{
					TRX_setFrequency(CurrentVFO->Freq, CurrentVFO);
					uint16_t LCD_bw_trapez_stripe_pos_new = LAYOUT->BW_TRAPEZ_POS_X + LAYOUT->BW_TRAPEZ_WIDTH / 2;
					LCD_bw_trapez_stripe_pos_new = LCD_bw_trapez_stripe_pos_new + (int16_t)((float32_t)(LAYOUT->BW_TRAPEZ_WIDTH * 0.9f) / 2.0f * ((float32_t)TRX_SHIFT / (float32_t)TRX.SHIFT_INTERVAL));
					if (abs(LCD_bw_trapez_stripe_pos_new - LCD_bw_trapez_stripe_pos) > 2)
					{
						LCD_bw_trapez_stripe_pos = LCD_bw_trapez_stripe_pos_new;
						LCD_UpdateQuery.StatusInfoGUI = true;
					}
				}
			}
			else
			{
				TRX_SHIFT = 0;
				TRX.IF_Gain = (uint8_t)(0.0f + ((1023.0f - mcp3008_value) * 60.0f / 1023.0f));
			}
		}

		// PTT
		if (PERIPH_FrontPanel_Buttons[b].type == FUNIT_CTRL_PTT)
		{
			static bool frontunit_ptt_state_prev = false;
			bool frontunit_ptt_state_now = false;
			if (mcp3008_value > PERIPH_FrontPanel_Buttons[b].tres_min && mcp3008_value < PERIPH_FrontPanel_Buttons[b].tres_max)
				frontunit_ptt_state_now = true;
			if (frontunit_ptt_state_prev != frontunit_ptt_state_now)
			{
				TRX_ptt_soft = frontunit_ptt_state_now;
				TRX_ptt_change();
				frontunit_ptt_state_prev = frontunit_ptt_state_now;
			}
		}

